app/services/platform_a_fetcher.rb

  	def initialize
  		VenuePlatform.find_or_create(platform_name='platform_a')
---
INSERT INTO "venue_platforms" ("created_at", "updated_at", "platform_name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-04-06 15:31:32.167610"], ["updated_at", "2021-04-06 15:31:32.167610"], ["platform_name", 0]]
SELECT "venue_platforms".* FROM "venue_platforms" WHERE "venue_platforms"."platform_name" = ? LIMIT ?  [["platform_name", 0], ["LIMIT", 1]]