app/controllers/venue_platforms_controller.rb

SELECT "venue_platforms".* FROM "venue_platforms"
---
  def index
    @venue_platforms = VenuePlatform.all